app/controllers/articles_controller.rb

  def index

    @articles = Article.all.page(params[:page]).per(4)
---
SELECT  "articles".* FROM "articles"  LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "articles"

  def create
   @article = Article.new(article_params)
   #@article.user_id =current_user.id
   @article.save
---
INSERT INTO "articles" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-01-09 09:59:12.308657"], ["title", "some title"], ["updated_at", "2015-01-09 09:59:12.308657"]]

  def update
    @article = Article.find(params[:id])

    @article.update(article_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 980190962]]
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = 980190962  [["title", "vijay articlee"], ["updated_at", "2015-01-09 12:35:17.090189"]]

  def destroy
   # byebug
    @article = Article.find(params[:id])
   @article.destroy
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 980190962]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 980190962]]