app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["article_id", 1], ["body", "check"], ["commenter", "test comment"], ["created_at", "2015-01-09 16:06:51.170424"], ["updated_at", "2015-01-09 16:06:51.170424"]]
---
	def create
		byebug
		@article =Article.find(params[:article_id])
		@comment=@article.comments.new(comment_params)
		@comment.user_id=current_user.id
		@comment.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 980190962]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."article_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["article_id", 980190962], ["id", 980190962]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 980190962]]
---
	def destroy
		byebug
		@article=Article.find(params[:article_id])
		@comment=@article.comments.find(params[:id])
		@comment.destroy